Tekla Open API Reference for Tekla Structures 2025
RebarComplexGeometry.BendingRadiuses Property
 The bending radiuses of the wire.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> BendingRadiuses { get; }
Public ReadOnly Property BendingRadiuses As List(Of Double)
	Get
Property Value
Type: List<Double>
See Also
Reference
RebarComplexGeometry Class
Tekla.Structures.Model Namespace